{"March 8, 2024": "\n\n\nNAVY\nRaytheon Missiles and Defense, Marlborough, Massachusetts, is awarded a $38,902,047 firm-fixed-price order under previously awarded basic ordering agreement (N00024-22-G-5311) for the procurement of Japan AEGIS system equipped vessel components and AEGIS components for Navy guided-missile destroyers. This contract combines purchases for the Navy (4%); and the government of Japan (96%), under the Foreign Military Sales (FMS) program. Work will be performed in Andover, Massachusetts (88%); Marlborough, Massachusetts (10%); and Chesapeake, Virginia (2%), and is expected to be completed by July 2027. FMS Japan funds in the amount of $37,173,966 (96%); and fiscal 2022 shipbuilding and conversion (Navy) funds in the amount of $1,728,081 (4%), will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1) (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Sea Systems Command, Washington, D.C., is the contracting activity.\nQ.E.D. Systems Inc.,* Virginia Beach, Virginia, was awarded a $30,799,231 cost-plus-award-fee modification to previously awarded contract N0002424C4201 for the specification development and availability execution Support requirements for the DDG, CG, LPD, LSD, LHA, LHD, and LCS Navy ship classes. Work will be performed in Virginia Beach, Virginia (50%); San Diego, California (30%); Marysville, Washington (10%); and Atlantic Beach, Florida (10%), and is expected to be completed by February 2025. Fiscal 2024 operations and maintenance (Navy) funds in the amount of $7,306,225 (98.69%); fiscal 2023 other procurement (Navy) funds in the amount of $54,700 (0.73%); and fiscal 2024 other procurement (Navy) funds in the amount of $43,200 (0.58%), will be obligated at time of award, of which, $7,306,225 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded March 7, 2024)\nMarine Hydraulics International LLC, Norfolk, Virginia, is awarded a not-to-exceed $19,084,186, firm-fixed-price, procuring contracting officer modification to the previously awarded, undefinitized contract action (N0002424C4406) for the repair, maintenance, and modernization of USS Mesa Verde (LPD 19) fiscal 2024 selected restricted availability. The scope of this procurement includes all labor, materials, supervision, facilities, equipment, production, testing, and quality assurance necessary to prepare for and accomplish the Chief of Naval Operations availabilities for critical modernization, maintenance and repair programs. This contract includes options which, if exercised, would bring the cumulative value of this contract to $147,248,303. Work will be performed in Norfolk, Virginia, and is expected to be completed by August 2025. Fiscal 2024 other procurement (Navy) funds in the amount of $9,349,955 will be obligated at the time of award and will not expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, D.C., is the contracting activity.\nLeidos Inc., Reston, Virginia, is awarded a $17,105,151 cost-plus-fixed-fee modification to previously awarded delivery order (N00024-23-F-6313) under indefinite-delivery/indefinite-quantity contract N00024-20-D-6337 to exercise an option for Overlord Unmanned Surface Vessels and Medium Unmanned Surface Vehicles operations and sustainment. Work will be performed in Reston, Virginia (51%); Virginia Beach, Virginia (26%); La Jolla, California (7%); Morgan City, Louisiana (6%); Lexington Park, Maryland (5%); Newport News, Virginia (4%); and Bethpage, New York (1%), and is expected to be completed by March 2025. Fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $2,500,000 will be obligated at time of award and will not expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.\nVigor Marine LLC, Portland, Oregon, was awarded a $15,845,754 firm-fixed-price modification to a previously awarded contract (N00024-19-C-4447) to perform a 237-day pier side extension for the USS Cape St. George (CG 71) fiscal 2021 modernization period availability. Work will be performed in Seattle, Washington, and is expected to be completed by October 2024. Fiscal 2018 other procurement (Navy) funding in the amount of $15,845,754 will be obligated at time of award and will not expire at the end of the current fiscal year. The Puget Sound Naval Shipyard and Intermediate Maintenance Facility, Bremerton, Washington, is the contracting activity. (Awarded Mar. 4, 2024)\nLockheed Martin Corp., Rotary and Mission Systems, Manassas, Virginia, is awarded a $15,636,492 cost-plus-incentive-fee modification to previously awarded contract (N00024-18-C-6258) to exercise options for engineering support, component procurements, and other direct costs in support of the Integrated Submarine Imaging System. Work will be performed in Manassas, Virginia (49%); Orlando, Florida (33%); Virginia Beach, Virginia (15%); Clearwater, Florida (1%); Andover, Massachusetts (1%); and Arlington, Virginia (1%), and is expected to be completed by September 2024. Fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $14,700,000 (94%); fiscal 2024 other procurement (Navy) funds in the amount of $627,146 (4%); and fiscal 2022 other procurement (Navy) funds in the amount of $309,346 (2%), will be obligated at time of award, of which $309,346 will expire at the end of the current fiscal year. Naval Sea Systems Command, Washington, D.C., is the contracting activity.\nBAE Systems Land and Armaments L.P., Minneapolis, Minnesota, is awarded a $12,967,143 firm-fixed-price delivery order against previously awarded basic ordering agreement N00174-23-G-0001, for the procurement of 39 MK38 MOD3 conversion kits. Work will be performed in Haifa, Israel (70%); and Louisville, Kentucky (30%), and is expected to be completed by January 2027. Fiscal 2024 weapons procurement (Navy) funds in the amount of $12,967,143 will be obligated at the time of award and will not expire at the end of the current fiscal year. This delivery order was not competitively procured in accordance with 10 U.S. Code 3204(a)(1), (only one responsible source and no other supplies or services will satisfy agency requirements.) Naval Surface Warfare Center Indian Head Division, Indian Head, Maryland, is the contracting activity (N0017424F0068). \nL3Harris Maritime Power & Energy Solutions Inc., Philadelphia, Pennsylvania, is awarded a $12,960,623 cost-plus-fixed-fee, level-of-effort, indefinite-delivery/indefinite-quantity contract for engineering and technical services required for obsolescence management of circuit protection and switchboard products on Navy ships and land-based test sites. This contract does not include options. Work will be performed in Philadelphia, Pennsylvania, and is expected to be completed by March 2029. Fiscal 2024 operations and maintenance (Navy) funds in the amount of $5,000 will be obligated at time of award via the initial task order and will expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 2304(c)(1), (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Surface Warfare Center, Philadelphia Division, Philadelphia, Pennsylvania, is the contracting activity (N64498-24-D-4005).\nAIR FORCE\nAkima Intra-Data LLC, Colorado Springs, Colorado; and Keesler Air Force Base, Mississippi, have been awarded a $28,958,885 firm-fixed-price modification (P00017) to previously awarded contract FA3002-23-C-0007 for base operations support services at Keesler AFB, Mississippi. Work will be performed at Keesler AFB and is expected to be completed March 31, 2025.  Fiscal 2024 operations and maintenance funds in the amount of $24,178,885 are being obligated at the time of award. Total cumulative face value of the contract is $51,692,873. The 81st Contracting Squadron, Keesler AFB, Mississippi, is the contracting activity.\nLeidos Inc., Reston, Virginia, has been awarded a $18,824,820 contract for cryptologic training-intelligence operations support. Work will be primarily performed in San Antonio, Texas, and is expected to be completed by March 16, 2025. Fiscal 2024 operation and maintenance funds in the amount of $3,700,000 are being obligated at time of award. The Air Combat Command Acquisition Management and Integration Center, Detachment 2, Joint Base San Antonio-Lackland, Texas, is the contracting activity (FA7037-24-C-0004).\nThe Trustees of the University of Pennsylvania, Philadelphia, Pennsylvania, has been awarded a $13,562,839 cost contract for the design, development, evaluation, and demonstration of a software system that will effectively use privilege policy enforcement to compartmentalize existing software. The effort will provide both system and application-level solutions as well as provide support for variable compartment size and number of principals. The location of performance is Philadelphia, Pennsylvania, and the work is expected to be complete by March 7, 2028. This award is the result of a competitive acquisition, and 27 offers were received. Air Force Research Laboratory/RIKE, Rome, New York, is the contracting activity (FA8750-24-C-B042).\nStellar Science Ltd. Co., Albuquerque, New Mexico, has been awarded a $11,368,809 cost-plus-fixed-fee task order for research and development, phase three foundation and expansion of the advanced framework for simulation integration modeling. The work is expected to be complete by July 2025. This award is the result of a fair opportunity proposal request, three solicitations mailed, and three offers received. Fiscal 2023 and fiscal 2024 research and development funds in the amount of $839,038 is being obligated at the time of award. Air Force Research Laboratory, Aerospace Systems Contracting Branch, Wright Patterson Air Force Base, Dayton, Ohio, is the contracting activity (FA8650-21-D2621/FA2391-24-FB008).\nRadiance Technologies, Huntsville, Alabama, has been awarded a cost-plus-fixed-fee $10,298,158 task order for research and development, phase three foundation and expansion of the advanced framework for simulation integration modeling. The work is expected to be complete by July 2025. This award is the result of a fair opportunity proposal request, three solicitations mailed, and three offers received. Fiscal 2024 research and development funds in the amount of $750,000 are being obligated at the time of award. Air Force Research Laboratory, Aerospace Systems Contracting Branch, Wright Patterson Air Force Base, Dayton, Ohio, is the contracting activity (FA8650-21-D2622/FA2391-24-FB007).\nRaytheon BBN Technologies Corp., Cambridge, Massachusetts, was awarded a $9,659,284 cost-plus, fixed-fee contract for analysis and restructuring containment. Work will be performed in Cambridge, Massachusetts, and is expected to be completed by March 6, 2028. This contract was a competitive acquisition, and 27 offers were received. Fiscal 2023 research and development funds in the amount of $1,234,582 are being obligated at the time of award. The Air Force Research Laboratory/RIKE, Rome, New York, is the contracting activity (FA8750-24-C-B031).\nDEFENSE HEALTH AGENCY\nCellphire Inc., Rockville, Maryland, is awarded $20,000,000 for a cost-reimbursement, ceiling increase, in-scope modification (W81XWH-20-C-0030) to achieve a commercially viable cryopreserved platelet product for U.S. Food and Drug Administration licensure. The new contract ceiling is $44,909,972. Place of performance is Frederick, Maryland. The period of performance is Dec. 20, 2019, to July 31, 2028. The awardee will conduct all development, test and evaluation, manufacturing, and regulatory activities to achieve an FDA-licensed cryopreserved platelet product that is suitable for both civilian and military use. The awardee will explore development strategies that will enable rapid licensure and availability of CPP. Fiscal 2024 research, development, test, and evaluation funding is obligated at the time of award. The U.S. Army Medical Research Acquisition Activity, Fort Detrick, Maryland, is the contracting activity.\nDEFENSE ADVANCED RESEARCH PROJECTS AGENCY\nLeidos Inc., Reston, Virginia, was awarded an $8,570,199 cost-plus-fixed-fee contract for the Quantum Augmented Network (QuaNET) program. QuaNET seeks to integrate quantum and classical networking approaches to provide quantum physics-based security capabilities to critical network infrastructures. Work will be performed in Arlington, Virginia (34%); Huntsville, Alabama (26%); Vista, California (22%); and Austin, Texas (18%), with an expected completion date of June 2028. Fiscal 2023 research, development, test and evaluation funds in the amount of $5,057,807 are being obligated at time of award. This contract was a competitive acquisition under Broad Agency Announcement HR001123S0035, and 18 offers were received. The Defense Advanced Research Agency, Arlington, Virginia, is the contracting activity (HR0011-24-C-0438).\nRaytheon BBN Technologies Corp., Cambridge, Massachusetts, was awarded a $7,527,101 cost-plus-fixed-fee contract for the Quantum Augmented Network (QuANET) program. QuANET seeks to integrate quantum and classical networking approaches to provide quantum physics-based security capabilities to critical network infrastructures. Work will be performed in Cambridge, Massachusetts (72%); Tucson, Arizona (12%); Austin, Texas (5%); La Jolla, California (5%); Hadley, Massachusetts (5%); and San Jose, California (1%), with an expected completion date of December 2025. Fiscal 2023 and fiscal 2024 research, development, test and evaluation funds in the amount of $4,981,195 are being obligated at time of award. This contract was a competitive acquisition under Broad Agency Announcement HR001123S0035, and 18 offers were received. The Defense Advanced Research Agency, Arlington, Virginia, is the contracting activity (HR0011-24-C-0405).\n*Small Business\n\n\n", "March 7, 2024": "\n\n\nNAVY\nThe Boeing Co., St. Louis, Missouri, is awarded a $94,521,598 firm-fixed-price order (N0001924F0118) against a previously issued basic ordering agreement (N0001921G0006). This order provides for the production and delivery of 96 Trailing Edge Flap R2 shipsets in support of F/A-18E/F and EA-18G aircraft retrofit efforts for the Navy. Work will be performed in St. Louis, Missouri (50%); Emmen, Switzerland (30%); Paramount, California (13%); Hot Springs, Arkansas (5%); Hayden, Idaho (2%); and is expected to be completed in June 2026. Fiscal 2023 aircraft procurement (Navy) funds in the amount of $49,114,572 and fiscal 2022 aircraft procurement (Navy) funds in the amount of $45,407,025 will be obligated at the time of award, $45,407,025 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.\nTriman Industries Inc., Morristown, New Jersey, is awarded $21,521,228 firm-fixed-price, for the procurement of five components of the multi-mission signal processor used in the AEGIS combat system. The ordering period is expected to be completed by November 2024. All work will be performed in Yonkers, New York. Annual working capital funds (Navy) in the full amount of $21,521,228 will be obligated at the time of award. Funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Mechanicsburg, Pennsylvania, is the contracting activity (N00104-24-F-RS00).\nLockheed Martin Corp., Rotary and Mission Systems, Liverpool, New York, is awarded a $17,548,199 cost-plus-incentive-fee modification to previously awarded contract N00024-23-C-6106 for engineering and maintenance services at Naval Undersea Warfare Center Detachment Pacific, Pearl Harbor Submarine Torpedo Intermediate Maintenance Activity in support of MK 48 Heavyweight Torpedo efforts. Work will be performed in Pearl Harbor, Hawaii, and is expected to be completed by February 2025. Fiscal 2024 operation and maintenance (Navy) funds in the amount of $1,932,000 will be obligated at the time of award and will expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, D.C., is the contracting activity.\nTechnical Systems Integration, Inc.,** Norfolk, Virginia, is awarded a $15,298,603 firm-fixed-price indefinite-delivery/indefinite-quantity contract for aviation training analysis and evaluation products to include, training situation documents, instructional performance requirements documents, instructional media requirements documents, military characteristics documents, training effectiveness evaluation plans, and training device fidelity reports to support the acquisition lifecycle phases for the Naval Aviation Enterprise. Work will be performed in Orlando, Florida, and is expected to be completed in March 2029. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was competitively procured as a Service-Disabled Veteran Owned Small Business set-aside; seven offers were received. Naval Air Warfare Center Training Systems Division Orlando, Florida, is the contracting activity (N6134024D0005).\nARMY\nTipton-FSI JV LLC,* Indian Mound, Tennessee, was awarded a $16,171,142 modification (P00025) to contract W912PM-20-C-0010 for operation and maintenance support services for the Military Ocean Terminal. Work will be performed in Southport, North Carolina, with an estimated completion date of March 1, 2025. Fiscal 2020, 2021, 2022, 2023, and 2024 operation and maintenance, Army funds and defense working capital funds in the amount of $16,171,142 were obligated at the time of the award. U.S. Army Corps of Engineers, Wilmington, North Carolina, is the contracting activity. \nAhtna Marine & Construction Co. LLC,* Boynton Beach, Florida, was awarded a $9,867,287 firm-fixed-price contract for maintenance dredging. Bids were solicited via the internet with three received. Work will be performed in Charleston, South Carolina, with an estimated completion date of Dec. 2, 2024. Fiscal 2024 civil operation and maintenance funds in the amount of $9,867,287 were obligated at the time of the award. U.S. Army Corps of Engineers, Charleston, South Carolina, is the contracting activity (W912HP-24-C-0003). \nDEFENSE LOGISTICS AGENCY\nBase Utilities Inc.,* Minot Air Force Base, North Dakota, has been awarded a maximum $16,127,095 modification (P00029) to a 50-year utilities contract (SP0600-18-C-8322) with no option periods for additional water and wastewater systems at Grand Forks Air Force Base and Cavalier Space Force Station, North Dakota. This is a fixed-price with economic-price-adjustment contract. Performance completion date is Jan. 31, 2069. Using military service is Air Force. Type of appropriation is fiscal 2024 through 2069 Air Force operations and maintenance funds. The contracting activity is the Defense Logistics Agency Energy, Fort Belvoir, Virginia.\nUPDATE: Griffmaier LLC, Santa Rosa Beach, Florida (SPE2DE-24-D-0016, $9,000,000), has been added as an awardee to the multiple award contract for laboratory equipment, accessories and consumables for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DE-22-R0006 and awarded Feb. 24, 2023.\n*Small Business\r\n**Service Disabled Veteran Owned Small Business\n\n\n", "March 6, 2024": "\n\n\nNAVY\nIntegration Innovation Inc., Huntsville, Alabama, is awarded a $187,317,453 firm-fixed-price, indefinite-delivery/indefinite-quantity contract to design, develop, test, and deliver self-directed interactive training and instructor-facilitated interactive courseware training products for Navy aviation and aircrew ratings in support of the Ready Relevant Learning Content Conversion Aviation training requirements. Work will be performed in Huntsville, Alabama, and is expected to be completed in March 2029. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was competitively procured via an electronic request for proposal; four offers were received. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity (N6134024D0006).\nBAE Systems Land & Armaments LP, Sterling Heights, Michigan, is awarded a $181,888,089 firm-fixed-price modification to a previously awarded contract (M67854-16-C-0006) for Amphibious Combat Vehicles (ACV). The total cumulative face value of the contract is $2,732,764,209. This contract modification provides for the exercise of options for the procurement of 34 full rate production ACV personnel variants and associated production, fielding and support costs, and cyclic maintenance. Work will be performed in York, Pennsylvania (60%); Aiken, South Carolina (15%); San Jose, California (15%); Sterling Heights, Michigan (5%); and Stafford, Virginia (5%), with an expected completion date of July 2026. Fiscal 2024 procurement (Marine Corps) funds in the amount of $181,888,089 will be obligated at the time of award and will not expire at the end of the current fiscal year. Marine Corps Systems Command, Quantico, Virginia, is the contracting activity (M67854-16-C-0006).\nAviation Systems Engineering Co. Inc.,* Lexington Park, Maryland, is awarded a $58,000,000 modification (P00009) to a previously awarded cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract (N0042120D0123). This modification increases the contract ceiling to provide engineering, technical, and program management support and mission systems-related capabilities, including, but not limited to, research, development, test, and evaluation of avionics and airborne anti-submarine warfare development and test tool sets, multi-level security solutions, offensive and defensive tools and capabilities, and associated supplies in support airborne, sub-surface, and ground-based capabilities for the Navy. Work will be performed in Patuxent River, Maryland (94%); Whidbey Island, Washington (2%); Jacksonville, Florida (2%); and Crane, Indiana (2%), and is expected to be completed in September 2025. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. Naval Air Warfare Center Aircraft Division Patuxent River, Maryland, is the contracting activity.\nLockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $54,550,000 modification (P00002) to a cost-plus-fixed-fee order (N0001922F0001) against a previously issued basic ordering agreement (N0001919G0008). This modification adds scope to provide non-recurring engineering and associated materials in support of power thermal management system controller and gun lube diminishing manufacturing sources and material shortages redesign effort in support of F-35 Joint Strike Fighter for the Navy, Air Force, Marine Corps, and non-Department of Defense (DOD) participants. Work will be performed in Fort Worth, Texas, and is expected to be completed in January 2030. Fiscal 2024 aircraft procurement (Air Force) funds in the amount of $22,306,859; fiscal 2024 aircraft procurement (Navy) funds in the amount of $22,306,858; and non-U.S. DOD participant funds in the amount of $9,936,282, will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.\nTraining Resources Limited, San Diego, California, is awarded a $36,056,405 indefinite-delivery/indefinite-quantity contract (N3220524D0033) to provide civilian mariners (CIVMARS) of Military Sealift Command with mariner training services, consisting of a portfolio of 16 different mariner training courses. The training course portfolio is comprised of 14 specialized mariner training courses and two generalized training courses for mariners, all to be attended at the contractor's facility. Each year under the contract, it is expected that between 700 and 2700 CIVMARS will attend the individually required training courses, taking place at Training Resources Limited's facilities located in San Diego, California and Norfolk, Virginia. This competitive procurement solicitation was posted to the System for Award Management website on Nov. 15, 2023, for 30 days and one proposal was received in response to the solicitation. This contract will be funded at the task order level. Each time a task order is issued, appropriate fiscal year working capital funds (Navy) will be obligated to fund the task order being issued. This contract will have a five-year ordering period and an option to extend the ordering period for an additional five-years in accordance with Federal Acquisition Regulation 52.217-9 and Defense Federal Acquisition Regulation Supplement 217.204. Military Sealift Command, Norfolk, Virginia, is the contracting activity.   \nGHD-COWI JV, San Diego, California, is awarded a $27,836,563 modification to a previously awarded task order (N6247323F4522) for architect-engineering services to support Navy construction projects in Malakal Port, Palau; and Yap Port, Yap, Federated States of Micronesia. This award brings the total cumulative face value of the task order to $49,033,792. Work will be performed in San Diego, California and is expected to be completed by March 2026. Fiscal 2022 military construction, (Defense-Wide) contract funds in the amount of $19,175,534; and Fiscal 2023 military construction (Defense-Wide) contract funds in the amount of $8,661,029, are obligated on this award and will not expire at the end of the current fiscal year. The Naval Facilities Engineering Systems Command, Southwest, San Diego, California, is the contracting activity.\nJ.F. Taylor Inc.,* Lexington Park, Maryland, is awarded a $22,672,547 modification (P00002) to a previously awarded cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract (N0042119D0074). This modification exercises an option to provide continued research, design, development, testing and integration, and associated engineering to include simulation-based initiatives and interconnectivity, in support of the Integrated Battlespace Simulation and Test division laboratories for the Navy. Work will be performed in Patuxent River, Maryland, and is expected to be completed in September 2024. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. Naval Air Warfare Center Aircraft Division, Patuxent River, Maryland, is the contracting activity.\nInteger Technologies LLC,* Columbia, South Carolina, is awarded a $9,826,205 cost-plus-fixed-fee contract for the Intelligent Data Management for Distributed Naval Platforms project. This contract provides for the development of decision-making tools for data management on board distributed naval platforms. The framework will include a combination of artificial and machine learning, and physics-based models that describe the holistic battlefield including platform state-of-health, environmental conditions and adversarial threats. This will be used to construct the situational awareness needed for distributed platforms to assess the criticality of data processed on board. Work will be performed in Louisiana State University, Baton Rouge, Louisiana (50%); Integer Technologies LLC, Baton Rouge, Louisiana (45%); and Integer Technologies LLC, Columbia, South Carolina (5%). Work is expected to be completed in March 2027. The total cumulative value of this contract, including a 36-month base period with no option periods, is $9,826,205. Fiscal 2023 research, development, test and evaluation (Navy) funds in the amount of $9,826,205 are obligated at time of award and will expire at the end of the current fiscal year. This contract was competitively procured under N00014-23-S-B001 entitled \"Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.\" Since proposals are received throughout the year under the Long-Range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001424C1302).\nInteger Technologies LLC,* Columbia, South Carolina, is awarded a $7,885,122 cost-plus-fixed-fee contract for the Resilient Autonomous Systems and Workforce Diversity project. This contract provides for increasing the resiliency of maritime autonomous systems by creating a digital environment to identify cyber vulnerabilities in their cyber-physical systems and Concept of Operations. This will include emulation of known exploit vectors as well as artificial and machine learning-based approaches to automatically find unknown vulnerabilities. The project will also intentionally increase the research capacity at Historically Black Colleges and Universities to strengthen the Navy's future workforce. Work will be performed in Benedict College, Columbia, South Carolina (50%); Integer Technologies LLC, Columbia, South Carolina (40%); Integer Technologies LLC, Silver Spring, Maryland (8%); and NineFX, Columbia, South Carolina (2%). Work is expected to be completed in March 2027. The total cumulative value of this contract, including a 36-month base period with no option periods, is $7,885,122. Fiscal 2023 research, development, test and evaluation (Navy) funds in the amount of $7,885,122 are obligated at time of award and will expire at the end of the current fiscal year. This contract was competitively procured under (N00014-23-S-B00)1 entitled \"Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.\" Since proposals are received throughout the year under the Long-Range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001424C1309).\nARMY\nEagle Integrated Services LLC,* San Antonio, Texas, was awarded a $99,000,000 cost-plus-fixed-fee contract for staff augmentation support services. Bids were solicited via the internet with 14 received. Work locations and funding will be determined with each order, with an estimated completion date of March 5, 2029. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W56JSR-24-D-0001).  \nAccurate Energetic Systems LLC,* McEwen, Texas (W52P1J-19-D-0028; P00010); and Spectra Technologies LLC,* Camden, Arkansas (W52P1J-19-D-0029, P00010), will compete for each order of the $55,000,000 firm-fixed-price contract modification for Trinitrotoluene and Plastic-Bonded Explosive N-9 supplementary charges. Bids were solicited via the internet with four received. Work locations and funding will be determined with each order, with an estimated completion date of June 6, 2025. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity.  \nCredence Management Solutions LLC,* Vienna, Virginia, was awarded a $11,194,436 labor-hours contract for technical and program support services. Bids were solicited via the internet with three received. Work will be performed in Alexandria, Virginia, with an estimated completion date of Sept. 24, 2028. Fiscal 2024 operation and maintenance, Army funds in the amount of $2,561,916 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity (W519TC-24-F-0104). \nDEFENSE LOGISTICS AGENCY\nAllied Tube and Conduit Corp., Harvey, Illinois, has been awarded a maximum $28,000,000 fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract for barbed tape concertina wire. This was a competitive acquisition with one response received. This is a two-year base contract with three one-year option periods. Location of performance is Ohio, with a March 6, 2026, ordering period end date. Using military services are Army, Navy, Air Force, and Marine Corps. Type of appropriation is fiscal 2024 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE8E6-24-D-0002).\nCapps Shoe Co. LLC,* Gretna, Virginia, has been awarded a maximum $22,357,715 fixed-price, indefinite-delivery/indefinite-quantity contract for men's and women's dress oxford shoes. This was a competitive acquisition with three responses received. This is a three-year contract with no option periods. Location of performance is Michigan, with a March 6, 2027, ordering period end date. Using military service is Army. Type of appropriation is fiscal 2024 through 2027 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-24-D-0037).\nUPDATE: A-dec Inc., Newberg, Oregon (SPE2DH-24-D-0006, $48,500,000), has been added as an awardee to the multiple award contract for medical equipment and accessories for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DH-21-R0002 and awarded Feb. 10, 2022. \n*Small Business\n\n\n", "March 5, 2024": "\n\n\nAIR FORCE\nGeneral Dynamics Mission Systems Inc., Scottsdale, Arizona, was awarded a $239,300,000 ceiling, indefinite-delivery/indefinite-quantity contract for the U.S. Battlefield Information Collection and Exploitation System, trusted network environment cross domain solution. This contract provides for services to sustain and enhance current coalition operations by providing the capability to share information rapidly and securely while collaborating with allies, partner nations and emerging coalitions worldwide on disparate networks simultaneously at the secret releasable level.  Work will be performed at various locations worldwide and is expected to be completed by Feb. 28, 2029.  This contract was a sole-source acquisition. The Secretary of the Air Force, Concepts Development and Management Contracting Office, Fairfax, Virginia, is the contracting activity (FA7146-24-D-0001). (Awarded March 1, 2024)\nGeneral Dynamics Mission Systems Inc., Scottsdale, Arizona, was awarded a $39,972,491 cost-plus-fixed-fee task order for U.S. Battlefield Information Collection and Exploitation System trusted network environment cross domain solution-development task order. This contract provides for services and associated supplies to the U.S. government for engineering, development, testing, assessment, deployment, and support to the trusted network environment. Work will be performed at various locations worldwide and is expected to be completed by Feb. 28, 2026. This contract was a sole-source acquisition. Fiscal 2024 research, development, test and evaluation in the amount of $25,732,356 are being obligated at time of award. The Secretary of the Air Force, Concepts Development and Management Contracting Office, Fairfax, Virginia, is the contracting activity (FA7146-24-F-0012). (Awarded March 1, 2024)\nNorth Point Defense, Rome, New York, was awarded a $24,309,175 cost-plus-fixed-fee task order for Warfighter Integration Program information technology. This contract provides research and operational systems development to identify, decode and exploit signals from information technology and communications systems, as well as conduct research, development, test and evaluation on new requirements and evolving technology. Additionally, the contract will focus on countering technical advancements in adversary signals and systems, automating existing manually intensive processes, exploiting new vulnerabilities, and contributing capability as part of an all-domain environment. Work will be performed in Rome, New York, and is expected to be completed by March 3, 2028. This contract was a competitive acquisition and one offer was received. Fiscal 2023 and 2024 research, development, test, and evaluation funds in the amount of $858,490 are being obligated at time of award. The Air Force Research Laboratory/RIKD-Information Warfare Contracting Branch, Rome, New York, is the contracting activity (FA8750-24-F-B008).\nBlackSky Geospatial Solutions Inc., Herndon, Virginia, was awarded a $23,689,059 ceiling contract award for Global Moving Target Engagement. This contract will provide research and development around Global Moving Target Engagement. Work will be performed in Albuquerque, New Mexico, and is expected to be completed by June 15, 2028. This contract was a competitive acquisition and one offer was received. Fiscal 2023 research and development funds in the amount of $3,538,098 are being obligated at time of award. The Air Force Research Laboratory, Space Vehicle Directorate, Integrated Experiments and Evaluation Contracting Branch, Kirkland Air Force Base, New Mexico, is the contracting activity (FA9453-24-C-0001).\nIntegrated Procurement Technologies, Vandalia, Ohio, was awarded a $ 22,763,707 firm‐fixed‐price, requirements contract for the purchase of AN/APN-232 Combined Altitude Radar Altimeter (CARA), sub-assemblies and signal data converter repairs. This contract provides for the procurement of services required for one of the sub-assemblies of the CARA receiver transmitter and one line replacement unit used on multiple Air Force aircraft. Work will be performed in Melbourne, Florida, and is expected to be completed by March 4, 2029. This contract was a sole source acquisition. No funds are being obligated at time of award. The Air Force Sustainment Center, Robins Air Force Base, Georgia, is the contracting activity (FA8539‐24‐D‐0002).\r\n \r\nJE DUNN Construction Co., Kansas City, Missouri, has been awarded a $15,805,243 firm-fixed-price modification, to previously awarded contract FA8903-19-C-0021 for repair of the Cadet Chapel at the Air Force Academy in Colorado Springs, Colorado. The modification brings the total cumulative face value of the contract to $240,688,913 from $224,883,670. Work will be performed at the Cadet Chapel, U.S. Air Force Academy, Colorado and is expected to be completed by June 8, 2026.  Fiscal 2019 operations and maintenance funds in the amount of $15,805,243 are being obligated at the time of modification award. The 772 Enterprise Sourcing Squadron, Joint Base San Antonio-Lackland, San Antonio, Texas, is the contracting activity.\r\n \r\nCORRECTION: The March 4, 2024, announcement of a not-to-exceed $988,000,000 multiple award, indefinite-delivery/indefinite-quantity contract for the Air Combat Command Directorate of Operations to Potomac Healthcare Solutions LLC, Woodbridge, Virginia (FA4890-24-D-0001); Laredo Technical Services Inc., San Antonio, Texas (FA4890-24-D-0002); T3i Inc., Imperial Beach, California (FA4890-24-D-0003); Reef Systems Corp., Cary, North Carolina (FA4890-24-D-0004); LMR Technical Group LLC, Dallas, Texas (FA4890-24-D-0005); and Bering Straits Information Technology LLC, Anchorage, Alaska (FA4890-24-D-0006),included an incorrect completion date.  The contract is actually expected to be completed by March 31, 2034.\nARMY\nLockheed Martin Corp., Grand Prairie, Texas, was awarded a $219,705,220 modification (P00002) to contract W31P4Q-23-C-0052 for the Precision Strike Missile Early Operational Capability Lot 3 requirement. Work will be performed in Grand Prairie, Texas, with an estimated completion date of March 6, 2026. Fiscal 2023 and 2024 missile procurement, Army funds and fiscal 2023 reimbursable cooperative funds in the amount of $219,705,220 were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.  \nTRX Systems, Greenbelt, Maryland, was awarded a $9,932,153 firm-fixed-price contract for Dismounted Assured Positioning, Navigation, and Timing Systems Generation II Line Replaceable Units and associated support services. Bids were solicited via the internet with one received. Work will be performed in Greenbelt, Maryland, with an estimated completion date of Oct. 12, 2024. Fiscal 2010 other procurement, Army funds in the amount of $9,932,153 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W56KGY-24-F-0027). \nDEFENSE LOGISTICS AGENCY\nBernard Cap LLC,* Hialeah, Florida, has been awarded a maximum $43,907,294 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for men’s, woman’s and General Officer lightweight jackets. This was a competitive acquisition with five responses received. This is a five-year contract with no option periods. The ordering period end date is March 4, 2029. Using military service is Air Force. Type of appropriation is fiscal 2024 through 2029 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-24-D-0035).\nPentaq Manufacturing Corp.,** Sabana, Puerto Rico, has been awarded a maximum $14,281,650 modification (P00012) exercising the first one-year option period of a one-year base contract (SPE1C1-23-D-0035) with four one-year option periods for blouses and trousers. This is a firm-fixed-price, indefinite-delivery/indefinite-quantity contract. The ordering period end date is March 9, 2025. Using military service is Marine Corps. Type of appropriation is fiscal 2024 through 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-23-D-0035).  \n*Small Business\r\n**Small business in historically underutilized business zones\n\n\n", "March 4, 2024": "\n\n\nAIR FORCE\nPotomac Healthcare Solutions LLC, Woodbridge, Virginia (FA4890-24-D-0001); Laredo Technical Services Inc., San Antonio, Texas (FA4890-24-D-0002); T3i Inc., Imperial Beach, California (FA4890-24-D-0003); Reef Systems Corp., Cary, North Carolina (FA4890-24-D-0004); LMR Technical Group LLC, Dallas, Texas (FA4890-24-D-0005); and Bering Straits Information Technology LLC, Anchorage, Alaska (FA4890-24-D-0006), have been awarded a combined, not-to-exceed $988,000,000, multiple award, indefinite-delivery/indefinite-quantity contract for the Air Combat Command Directorate of Operations. This contract provides for human performance services, supporting multiple customers and locations across the Air Force and Department of Defense. Work will be performed worldwide and is expected to be completed by March 31, 2024. These awards are the result of a competitive acquisition, and 11 offers were received. Fiscal 2024 operation and maintenance funds in the amount of $6,000 ($1,000 per awardee) are being obligated at time of award. Air Combat Command Acquisition Management and Integration Center, Joint Base Langley Eustis, Virginia, is the contracting activity.\nARMY\nIntegris Composites Inc., Hebron, Ohio, was awarded a $367,000,000 modification (P00022) to contract W91CRB-19-D-0014 for Vital Torso Protection Generation III Enhanced Small Arms Protection Inserts plates. Work locations and funding will be determined with each order, with an estimated completion date of March 5, 2028. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity. \nLeading Technology Composites Inc.,* Wichita, Kansas, was awarded a $367,000,000 modification (P00024) to contract W91CRB-19-D-0014 for Vital Torso Protection Generation III Enhanced Small Arms Protection Inserts plates. Work locations and funding will be determined with each order, with an estimated completion date of March 5, 2028. U.S. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity.   \nConsortium Management Group Inc., Washington, D.C., was awarded a $178,426,383 modification (P00888) to contract W15QKN-17-9-5555 for Phase 3 of the Tactical Intelligence Targeting Access Node. Work will be performed in Washington, D.C., with an estimated completion date of Feb. 28, 2026. Fiscal 2024 research, development, test and evaluation, Army funds in the amount of $52,680,570 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity. (Awarded Feb. 29, 2024) \nKamadulski Excavating and Grading Co. Inc.,* Granite City, Illinois, was awarded a $9,208,197 firm-fixed-price contract for construction of the Wood River Sewer separation project. Bids were solicited via the internet with three received. Work will be performed in Wood River, Illinois, with an estimated completion date of March 5, 2028. Fiscal 2023 civil construction funds in the amount of $9,208,197 were obligated at the time of the award. U.S. Army Corps of Engineers, St. Louis, Missouri, is the contracting activity (W912P9-24-C-0009). \nNAVY\nC&S Services Inc.,* Ewa Beach, Hawaii (N32253-24-D-0100); Confluence Corp., doing business as Regal Service Co.,* Honolulu, Hawaii (N32253-24-D-0200); Delphinus Engineering Inc.,* Eddystone, Pennsylvania (N32253-24-D-0300); Epsilon Systems Solutions Inc.,* Portsmouth, Virginia (N32253-24-D-0400); Marisco Ltd.,* Kapolei, Hawaii (N32253-24-D-0500); Propulsion Controls Engineering,* Aiea, Hawaii (N32253-24-D-0600); Pacific Shipyards International LLC,* Honolulu, Hawaii (N32253-24-D-0700); and QED Systems Inc.,* Virginia Beach, Virginia (N32253-24-D-0800), were awarded indefinite-delivery/indefinite-quantity, fixed-price contracts with an estimated combined value of $104,763,392 for the repair, maintenance, and alteration of U.S. government waterborne vessels and surface ships visiting or homeported in Hawaii and to procure any materials in support of these activities. Each awardee was awarded $2,500 (minimum contract guarantee per awardee) using fiscal 2024 operations and maintenance (Navy) funding for a total amount of $20,000 that will expire at the end of the current fiscal year. All other funding will be made available at the delivery order level. These contracts include options which, if exercised, would bring the cumulative value to $226,212,877. Work will be performed in Hawaii and is expected to be completed by March 2029. If all options are exercised, work will continue through March 2034. This contract was competitively procured via the System for Award Management website, with eight offers received. Pearl Harbor Naval Shipyard and Intermediate Maintenance Facility, Pearl Harbor, Hawaii, is the contracting activity. (Awarded Feb. 22, 2024)\nLockheed Martin Rotary and Mission Systems, Moorestown, New Jersey, was awarded a $34,142,015 cost-plus-fixed-fee and cost-plus-incentive-fee type modification to previously awarded contract (N00024-24-C-5131) to exercise options for AEGIS development and test sites operation and maintenance at the Combat Systems Engineering Development Site, SPY-1A Test Facility and Naval Systems Computing Center. This contract involves Foreign Military Sales to several countries. Work will be performed in Moorestown, New Jersey, and is expected to be completed by January 2025. Foreign Military Sales (FMS) (Japan) funding in the amount of $6,696,730 (34%); FMS (Australia) funding in the amount of $5,127,050 (26%); FMS (Korea) funding in the amount of $2,704,285 (14%); fiscal 2013 shipbuilding and conversion (Navy) funds in the amount of $1,958,721 (10%); fiscal 2024 research development and test and evaluation (Navy) funds in the amount of $1,628,911 (8%); fiscal 2020 shipbuilding and conversion (Navy) funds in the amount of $667,179 (2%); FMS (Norway) funding in the amount of $340,457 (1%); fiscal 2024 operation and maintenance funding in the amount of $210,932 (1%); fiscal 2022 shipbuilding and conversion (Navy) funds in the amount of $138,020 (1%); fiscal 2021 shipbuilding and conversion (Navy) funds in the amount of $137,253 (1%); fiscal 2023 shipbuilding and conversion (Navy) funds in the amount of $137,253 (1%); and FMS (Spain) funding in the amount of $80,246 (1%), will be obligated at the time of award and funds in the amount of $2,169,653 will expire at the end of the current fiscal year. The Naval Sea Systems Command, Washington, D.C., is the contracting activity. (Awarded Feb. 29, 2024)\nJ & J and ALMS Mission Support Solutions LLC, Anchorage, Alaska, is awarded a $30,128,837 firm-fixed-price, indefinite-delivery/indefinite-quantity modification to previously awarded contract (N69450-22-D-0043) for base operations support services. This award brings the total cumulative value of the contract to $61,453,749. Work will be performed in Pensacola, Florida, and is expected to be completed by March 2025. No funds will be obligated at time of award. Naval Facilities Engineering Systems Command Southeast, Jacksonville, Florida, is the contracting activity.\nIntellect Solutions LLC,*Alexandria, Virginia, was awarded a $15,612,466 cost-plus-fixed fee task order for support in the analysis, design, development, deployment and maintenance of Information Technology services and networks. This task order includes options which, if exercised, would bring the cumulative value of this contract to $80,167,670. Work will be performed at the U.S. Naval Research Laboratory (NRL), Washington, D.C., and is expected to be completed by February 2025. Fiscal 2024 working capital fund (Navy) funds in the amount of $5,000,000 was obligated at the time of award and will not expire at the end of the current fiscal year. The task order was competitively procured with five offers received via Navy SeaPort. NRL, Washington, D.C., is the contracting activity (N0017819D7864, N0017324F3003).\nWoods Hole Oceanographic Institution, Woods Hole, Massachusetts, is awarded a $13,583,918 cost-plus-fixed-fee contract for the ‘Development, Integration, Test and Demonstration of Next Generation Autonomous Underwater Vehicle Sensors and Capabilities’ effort. This contract provides for advancing the capabilities of autonomous underwater vehicles. This development effort will focus on improving or increasing vehicle endurance, speed and autonomous performance in a variety of environmental conditions. New vehicle designs will be explored and evaluated, as well as autonomous teaming scenarios. The deliverables from this contract will support uncrewed platform innovation for both surface and sub-surface operating modalities. Work will be performed in Woods Hole, Massachusetts. The total cumulative value of this contract, including a 36-month base period and one 24-month option period, is $13,583,918. The base period is $7,701,348 and options are $5,882,570. The base period is expected to be completed in March 2027, with the option period intended to run sequentially after completion of the base. Fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $300,000 are obligated at time of award and will not expire at the end of the current fiscal year. This contract was competitively procured under N00014-23-S-B001 entitled “Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.” Since proposals are received throughout the year under the Long-Range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001424C2209).\nTextron Systems Corp., Hunt Valley, Maryland, is awarded a $7,906,430 modification (P00012) to a firm-fixed-price order (N0001921F0315) against a previously issued basic ordering agreement (N0001921G0008). This modification exercises an option to provide continued unmanned aircraft systems intelligence, surveillance, and reconnaissance services, for an additional nine months, in support of the Department of Defense, other government agencies, and domestic and overseas contingency operations for the Navy. Work will be performed in Hunt Valley, Maryland (20%); and various locations outside the continental U.S. (80%), and is expected to be completed in February 2025. Fiscal 2024 operations and maintenance, (Navy) funds for $7,906,430 will be obligated at the time of award, $7,906,430 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.\nDEFENSE ADVANCED RESEARCH PROJECTS AGENCY\nSecuriGence LLC*, Leesburg, Virginia, has been awarded a $40,808,165 modification (P00031) to previously awarded task order HR001121F0006 for information technology multi-network support services. The modification brings the total cumulative face value of the task order to $334,107,688 from $293,299,522. Work will be performed in Arlington, Virginia, with an expected completion date of June 2024. Fiscal 2024 research and development funds in the amount of $21,201,011 are being obligated at time of award. The Defense Advanced Research Projects Agency, Arlington, Virginia, is the contracting activity.\nDEFENSE LOGISTICS AGENCY\nBoeing Distribution Services Defense, doing business as Boeing, O’Fallon, Missouri, has been awarded an estimated $11,449,675 fixed-price with economic-price-adjustment, indefinite-quantity contract for logistics and total supply chain management support at Tobyhanna Army Depot, Pennsylvania. This was a competitive acquisition with three responses received. This is a five-year base contract with two one-year option periods and six 30-day extensions. Location of performance is Pennsylvania, with a March 4, 2029, performance completion date. Using military service is Army. Type of appropriation is fiscal 2024 through 2029 defense working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Columbus, Ohio (SPE7LX-24-D-0031).\nDEFENSE HEALTH AGENCY\nLawelawe Technology Services LLC, Kailua, Hawaii, is awarded Option Period Two of a firm-fixed-price contract (HT001122C0019) to provide information technology and telecommunication services and provide professional administrative management in support of the Defense Health Agency Joint Operational Medicine Information System program. Work will be primarily performed at Fort Sam Houston, Texas. The total award amount of this option exercise modification is $10,092,718. Operation and maintenance funds in the amount of $10,092,718 will be obligated for fiscal 2024. The total contract value is $46,498,984. The contract was a direct award through the Small Business Administration 8(a) program in accordance with 15 U.S. Code 637 as implemented by Federal Acquisition Regulation 6.302-5(b)(4) and was executed on July 21, 2022. The period of performance for this option period exercise is March 9, 2024, to March 8, 2025. The Defense Health Agency, Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity. (Awarded Feb. 29, 2024)\n*Small Business\n\n\n", "March 1, 2024": "\n\n\nNAVY\nLockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $663,134,662 modification (P00094) to a previously awarded cost-plus-fixed-fee, cost-plus incentive-fee, firm-fixed-price-incentive, firm-fixed-price contract (N0001921C0020). This modification adds scope to provide recurring logistics support, including ground maintenance activities, action request resolution, depot activation activities, automatic logistics information system operations and maintenance, reliability and maintainability, supply chain management, pilot and maintainer training, and training system sustainment in support of F-35 Lightning II Joint Strike Fighter Air Systems sustainment efforts for the Navy, Air Force, Marine Corps, Foreign Military Sales (FMS) customers, and non-U.S. Department of Defense (DOD) participants. Work will be performed Fort Worth, Texas (57%); Orlando, Florida (26%); Greeneville, South Carolina (11%); Samlesbury, United Kingdom (4%); El Segundo, California (2%), and is expected to be completed in June 2027. Fiscal 2024 operations and maintenance (Air Force) funds in the amount of $226,328,661; fiscal 2024 operations and maintenance (Navy) funds in the amount of $80,585,851; FMS customer funds in the amount of $58,849; and non-U.S. DOD participant funds in the amount of $130,674,597, will be obligated at the time of award, $306,914,242 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity. \nLockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded a $170,788,791 firm-fixed-price modification (P00019) to a previously awarded indefinite-delivery, indefinite-quantity contract (N0001919D0015). This modification adds scope to procure Ancillary Mission Equipment (AME) in support of meeting Lot 17 Batch 1B-2 Group One requirements, a subset of the overall Lot 17 AME requirements for the F-35 Joint Strike Fighter program in support of the Air Force, Marine Corps, Navy, Foreign Military Sales customers, and F-35 Cooperative Program Partners. Work will be performed in Fort Worth, Texas, and is expected to be completed in July 2026. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity. \nLockheed Martin Space, Titusville, Florida, is awarded a cost-plus-fixed-fee $109,254,610 contract (N0002024C2017) to support the integration of the Trident II (D5) Missile and reentry subsystems into the Common Missile Compartment for the U.S./U.K. Columbia/Dreadnought submarine construction programs. Work will be performed in Cape Canaveral, Florida (57.4%); Sunnyvale, California (15.9%); Denver, Colorado (4.4%); Poway, California (3.2%); Groton, Connecticut (1.5%); Kings Bay, Georgia (1.3%); Cocoa, Florida (1.2%); Titusville, Florida (1.2%); Courtland, Alabama (1.1%); Valley Forge, Pennsylvania (1.1%); and other various locations (less than 1.0% each, 11.7% total). Work is expected to be complete by Feb. 28, 2029. Fiscal 2024 shipbuilding and conversion (Navy) funds in the amount of $80,923,245; and foreign funds (non-foreign military sales) in the amount of $28,331,365, will be obligated at time of award. No funds will expire at the end of the current fiscal year. This contract is being awarded on a sole source basis under 10 U.S. Code 2304(c)(1) with one proposal received and was previously synopsized on the System for Award Management website. Strategic Systems Programs, Washington, D.C., is the contracting activity.   \nLockheed Martin Space, Littleton, Colorado, was awarded a $98,999,952 cost-plus-fixed-fee contract modification (P00077) to previously awarded contract N00030-19-C-0025 to provide program management and systems engineering support for Army All Up Round plus Canister definition and support.  Work will be performed in Denver, Colorado (48); Courtland, Alabama (39%); Huntsville, Alabama (7%); Sunnyvale, California (3%); and various other locations (less than 1.0% each, 3% total).  Work is expected to be completed on Feb. 25, 2025.  Fiscal 2023 Research Development Test and Evaluation, Army funds in the amount of $3,480,000 will be obligated on this award and will expire at the end of the current fiscal year.  This contract is being awarded to the contractor on a sole source basis under 10 U.S. Code 3204(a)(1) and was previously synopsized on the System for Award Management online portal. Strategic Systems Programs, Washington, D.C., is the contracting activity. (Awarded Feb. 27, 2024)\nAerostar Environmental and Construction LLC,* Mobile, Alabama, is awarded a maximum-value $20,000,000 firm-fixed-price, cost-plus-fixed-fee, indefinite-delivery/indefinite-quantity contract for environmental consulting services. Work will be performed in the contiguous United States and is expected to be completed by January 2029. Fiscal 2024 operation and maintenance (Navy) funds in the amount of $5,000 will be obligated at time of award to satisfy the minimum guarantee and will expire at the end of the current fiscal year. This contract was not competitively procured, in accordance with 10 U.S. Code 2304(a)(5) as implemented by Federal Acquisition Regulation 6.302-5 (authorized or required by statute). The Naval Facilities Engineering and Expeditionary Warfare Center, Port Hueneme, California, is the contracting activity (N39430-24-D-0050).\nAIR FORCE\nBoeing Space, El Segundo, California, has been awarded a $439,619,617 contract modification (P00156) to previously awarded contract FA8808-10-C-0001 for the production and launch of Wideband Global Satellite Communications Space Vehicle 12. The modification brings the total cumulative face value of the contract to $3,095,978,753. Work will be performed at El Segundo, California, and is expected to be completed by Jan. 31, 2029. Fiscal 2023 Space Force procurement funds in the amount of $439,619,617 are being obligated at time of award. Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.\nLockheed Martin Corp., Littleton, Colorado, has been awarded a $46,173,222 firm-fixed-price modification (P00064) to contract FA8823-21-C-0001 for space-based infrared system contractor logistics support, product support integration, and contract evolution. The modification brings the total cumulative face value of the contract $1,222,900,308. Work will be performed at Peterson Space Force Base, Buckley SFB, Greeley Air National Guard Station, and Boulder, Colorado, and is expected to be completed by Feb. 28, 2027. Fiscal 2023 and 2024 procurement funds in the amount of $46,173,222 are being obligated at time of award.  Space Systems Command, Peterson SFB, Colorado, is the contracting activity.\nL3Harris Corp., Colorado Springs, Colorado, has been awarded a $7,682,118 contract modification (P00150) to the previously awarded contract FA8819-19-C-0002 for continued support, sustainment, infrastructure, and delivery for satellite communications and modifications. The contract modification continued the enhancements, maintenance, and support of the range control software, specifically including maintenance and support for minimal viable product deployments. The modification brings the total cumulative face value of the contract to $577,308,734. Work will be performed at Kirtland Air Force Base, New Mexico; Schriever Space Force Base, Colorado; and MITRE Corp., Colorado Springs, Colorado, and is expected to be completed by Feb. 28, 2025. Fiscal 2024 research, development, test, and evaluation funds in the amount of $1,245,010 are being obligated at time of award. Space Systems Command, Los Angeles AFB, California, is the contracting activity.\nMISSILE DEFENSE AGENCY\nStrategic Alliance Solutions LLC*, JV, Fairfax, Virginia, is being awarded a competitive cost-plus-fixed-fee, level-of-effort contract.  The total value of this contract is $359,969,996.  Under this new contract, the contractor will provide support that includes: studies, analysis, and evaluations; and management and professional services. The work will be performed in Huntsville, Alabama; Fort Belvoir, Virginia; Colorado Springs, Colorado; Dahlgren, Virginia; Hanscom Air Force Base, Massachusetts; Kirkland AFB, New Mexico; and Peterson Space Force Base, Colorado.  The performance period is from March 2024 to August 2029. This contract was competitively procured via publication on the SAM.gov website with six proposals received.  Fiscal 2024 research, development, test and evaluation funds in the amount of $4,751,045 are being obligated on this award.  The Missile Defense Agency, Huntsville, Alabama, is the contracting activity (HQ0858-24-C-0002).\nAerojet Rocketdyne, Coleman Aerospace Inc., a wholly owned subsidiary of Aerojet Rocketdyne Inc., in Orlando, Florida, is being awarded an $11,100,000 modification (P00205) to a previously awarded contract (HQ1047-14-C-0001) to increase direct production labor hours.  The value of this contract, including unexercised options, is increased from $1,509,078,305 to $1,520,178,305. Under this modification, the contractor will provide Contract Line Item Number 0213 direct product labor hours for task instructions as set forth in the performance work statement. The work will be performed in Orlando, and Cape Canaveral Space Force Station, Florida. The performance period is from March 1, 2024, through Dec. 31, 2025. Fiscal 2024 and 2025 research, development, test and evaluation funds in the amount of $11,100,000 are being obligated on this award. The Missile Defense Agency, Huntsville, Alabama, is the contracting activity.\nARMY\nEnvironmental Chemical Corp., Burlingame, California (W912GB-24-D-0014); and Pond Constructors Inc., Peachtree Corners, Georgia (W912GB-24-D-0015), will compete for each order of the $29,000,000 firm-fixed-price contract for fuel systems sustainment, restoration and modernization services. Bids were solicited via the internet with four received. Work locations and funding will be determined with each order, with an estimated completion date of Feb. 28, 2029. U.S. Army Corps of Engineers, European District, is the contracting activity. \nJ.F. Brennan Co. Inc., La Crosse, Wisconsin, was awarded a $14,700,250 firm-fixed-price contract for the Webbers Falls Stilling Basin Repairs project. Bids were solicited via the internet with two received. Work will be performed in Webbers Falls, Oklahoma, with an estimated completion date of July 16, 2026. Fiscal 2024 civil construction funds in the amount of $14,700,250 were obligated at the time of the award. U.S. Army Corps of Engineers, Tulsa, Oklahoma, is the contracting activity (W912BV-24-C-0004).\nRaytheon/Lockheed Martin Javelin JV, Tucson, Arizona, was awarded a $7,859,917 modification (P00088) to contract W31P4Q-19-C-0059 for repair and maintenance support for the Javelin Weapon System. Work will be performed in Tucson, Arizona, with an estimated completion date of Aug. 30, 2024. Fiscal 2023 Foreign Military Sales funds; and fiscal 2024 special funds in the amount of $7,859,917, were obligated at the time of the award. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity.\n\n\n", "Feb. 29, 2024": "\n\n\nNAVY\nThe Boeing Co., Seattle, Washington, is awarded a $3,407,940,833 firm-fixed-price, undefinitized contract for the procurement and delivery of 17 Lot 13 P-8A Multi-Mission Maritime Aircraft (14 for the government of Canada and three for the government of Germany), as well as associated non-recurring engineering. Work will be performed in Seattle, Washington (98.22%); Huntington Beach, California (1.10%); Mesa, Arizona (0.41%); St. Louis, Missouri (0.17 %); El Segundo, California (0.06%); and Huntsville, Alabama (0.04 %), and is expected to be completed in March 2028. Foreign Military Sales customer funds in the amount of $1,190,593,943 will be obligated at time of award, none of which will expire at the end of the current fiscal year. This contract was not competitively procured pursuant to 10 U.S. Code Section 3204(e)(4)(E). Naval Air Systems Command Patuxent River, Maryland, is the contracting activity (N0001924C0025).\nThe Boeing Co., St. Louis, Missouri, is awarded a $680,070,000 firm-fixed-price, cost-plus-fixed fee, indefinite-delivery/indefinite-quantity contract to produce, deliver, and install aircrew and maintenance training systems software and hardware configuration upgrades and associated logistics support to include, spares procurement, support equipment, technical manual updates, software discrepancy report correction efforts, the development of new, and updates to, courseware and curriculum and on-site training in support of existing aircrew and maintenance training systems and subsystems including the Tactical Operational Flight Trainers, brief/debrief stations, mission operation centers, advanced development stations, low-cost trainers, Integrated Visual Environment Maintenance Trainers and maintenance trainer set devices in support of the F/A-18E/F and EA-18G aircrafts for the Navy and Royal Australian Air Force. Work will be performed in St. Louis, Missouri, and is expected to be completed in February 2029. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was not competitively procured pursuant to 10 U.S. Code 2304(a)(1). Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity (N6134024D0001).\nWhitman, Requardt & Associates LLP, Baltimore, Maryland, is awarded a maximum-value $90,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity architect-engineering contract for services in support of large projects primarily in Maine, New York, New Hampshire, Rhode Island, Connecticut, New Jersey, Pennsylvania, Indiana, and Illinois. An initial task order is being awarded for $5,000 in order to satisfy the minimum guarantee. Work will be performed in the Naval Facilities Engineering Systems Command Mid-Atlantic area of responsibility and is expected to be completed by February 2029. Fiscal 2024 operation and maintenance (Navy) funds in the amount of $5,000 will be obligated at time of award and will expire at the end of the current fiscal year. This contract was competitively procured via the SAM.gov website, with nine offers received. The Naval Facilities Engineering Systems Command Mid-Atlantic, Norfolk, Virginia, is the contracting activity (N40085-24-D-0009).\nHuntington-Ingalls Industries-Ingalls Shipbuilding, Pascagoula, Mississippi, is awarded an $80,038,980 cost-plus-award-fee modification to a previously awarded contract (N00024-19-C-4313) to exercise options for the accomplishment of the planning yard services for the Littoral Combat Ship in-service ships. Work will be performed in Hampton, Virginia (30%); Pascagoula, Mississippi (68%); San Diego, California (1%); and Jacksonville, Florida (1%), and is expected to be completed by April 2025. The Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-19-C-4313).\nTRU Simulation Plus Training Inc., Lutz, Florida, is awarded a $54,809,606 firm-fixed-price contract. This contract produces and delivers one T-54A Operational Flight Trainer, three unit training devices, 21 Desktop Avionics Trainers, four brief/debrief systems and one software support station including associated logistical support, and instructor, operator, and maintenance training in support of the Multi-Engine Training System Ground Based Training Systems for the Navy. Work will be performed in Lutz, Florida (70%); Orlando, Florida (10%); Herndon, Virginia (10%); and Wichita, Kansas (10%), and is expected to be completed in May 2026. Fiscal 2024 aircraft procurement (Navy) funds in the amount of $54,809,606 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. This contract was competitively procured via an electronic request for proposal; two offers were received. Naval Air Warfare Center Training Systems Division, Orlando, Florida, is the contracting activity (N6134024C0009).\nTusas Motor Sanayii A.S., Tusas Engine Industries, Inc., Tepebasi, Eskisehir, Turkey is awarded an indefinite-delivery/indefinite-quantity, firm-fixed-price contract with firm-fixed-price task order provisions, for depot level overhaul of LM2500 Single Shank Turbine Gas Generators. The contract ceiling is not to exceed $45,643,682. Work under this contract will take place at the contractor's facility in Eskisehir, Turkey, and is expected to be completed by October 2026. The contract will have a 14-month ordering period. Fiscal 2024 operations and maintenance (Navy) funding in the total amount of $500 (minimum guarantee per contract) will be obligated at time of award via an initial individual task order and will expire at the end of the current fiscal year. This contract results from utilization of \"Rolling Admissions\" procedures to add additional multiple award contract (MAC) holders under an existing MAC program. This contract was competitively procured using full and open competition via the www.sam.gov website, with three offers received. The Naval Surface Warfare Center, Philadelphia Division, Philadelphia, Pennsylvania is the contracting activity (N64498-24-D-4006).\nCACI, Inc.-Federal, Chantilly, Virginia, is awarded a $19,551,186 cost-plus-fixed-fee modification to a previously awarded task order (N3904020F3000) for engineering, technical, administrative, and managerial (support) services in support of the Ships Availability Planning and Engineering Center, non-nuclear waterfront, and Deep Submergence Systems programs at Portsmouth Naval Shipyard (PNS). Work will be performed in Kittery, Maine, and is expected to be completed by March 2025. Fiscal 2024 operation and maintenance (Navy) funding in the amount of $9,785,268 will be obligated at time of award and will not expire at the end of the current fiscal year. PNS, Kittery, Maine, is the contracting activity. \nQ.E.D. Systems Inc.,* Virginia Beach, Virginia, is awarded a $9,698,632 cost-plus-award-fee contract for the Specification Development and Availability Execution Support requirements for the DDG, CG, LPD, LSD, LHA, LHD, and LCS Navy Ship classes. This contract includes options which, if exercised, would bring the cumulative value of this contract to $383,093,984. Work will be performed in Virginia Beach, Virginia (50%); San Diego, California (30%); Marysville, Washington (10%); and Atlantic Beach, Florida (10%), and is expected to be completed by February 2025. If all options are exercised, work will continue through February 2029. Fiscal 2024 operations and maintenance (Navy) funds in the amount of $5,217,961 will be obligated at time of award, of which $5,217,961 will expire at the end of the current fiscal year. This contract was competitively procured via the Procurement Integrated Enterprise Environment, with one offer received. Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-24-C-4201).\nSyQwest Inc.,* Cranston, Rhode Island, is awarded an estimated $9,096,050 fixed-price, indefinite-delivery/indefinite-quantity contract for Next Generation Fathometers in support of the Navy's ships with a modern depth sounder that is used for safety of ship and completeness of navigational data. The contract has a five-year ordering period from 2024 to 2029. Work will be performed in Cranston, Rhode Island (100%). Delivery will be to Keyport, Washington, and work is expected to be completed by February 2029. Fiscal 2019, 2020, 2022, and 2023 shipbuilding and conversion (Navy) funds in the amount of $675,000 will be obligated at the time of issuing the first delivery order, shortly after contract award. Funds in the amount of $93,669 will expire Sept. 30, 2024.This contract was competitively procured with two offers received. Offers were solicited via the Procurement Integrated Enterprise Environment solicitation module and the System for Award Management website. Naval Undersea Warfare Center Division, Keyport, Washington, is the contracting activity (N00253-24-D-6000).\nARMY\nHoneywell International Inc., Phoenix, Arizona, was awarded a $41,934,407 cost-plus-fixed-fee contract for engineering, logistics, support and services for T55-GA-714 engines. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Sept. 30, 2027. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity (W58RGZ-24-D-0007).\nBAE Systems Ordnance Systems Inc., Radford, Virginia, was awarded a $20,549,342 modification (P00005) to contract W519TC-23-F-0017 to finalize design, construct, commission/startup and transition a new chemical grind facility. Work will be performed in Radford, Virginia, with an estimated completion date of Dec. 31, 2026. Fiscal 2022 procurement of ammunition, Army funds in the amount of $10,000,000 were obligated at the time of the award. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity. \nPride Industries, Roseville, California, was awarded a $14,841,163 firm-fixed-price contract for base operations support services. Bids were solicited via the internet with one received. Work will be performed at Fort Novosel, Alabama, with an estimated completion date of Aug. 31, 2024. Fiscal 2024 operation and maintenance, Army funds were obligated at the time of the award. Army Field Directorate Office, Fort Eustis, Virginia, is the contracting activity (W9124G-24-C-0003). \nDJM-Merlo JV LLC,* St. Louis, Missouri, was awarded a $12,449,322 firm-fixed-price contract for landscaping, lighting and irrigation. Bids were solicited via the internet with one received. Work will be performed in St. Louis, Missouri, with an estimated completion date of March 2, 2026. Fiscal 2019 military construction, Army funds in the amount of $12,449,322 were obligated at the time of the award. U.S. Army Corps of Engineers, Kansas City, Missouri, is the contracting activity (W912DQ-24-C-7002). \nTextron Systems, Hunt Valley, Maryland, was awarded an $11,808,000 cost-plus-fixed-fee contract for design of one Advanced Reconnaissance Vehicle Medium Caliber Autocannon prototype vehicle. Bids were solicited via the internet with one received. Work will be performed in Hunt Valley, Maryland, with an estimated completion date of Sept. 24, 2024. Fiscal 2024 research, development, test and evaluation, Marine Corps funds in the amount of $5,892,192 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W56HZV-24-C-0029). \nGeneral Dynamics Land Systems, Sterling Heights, Michigan, was awarded a $10,926,309 cost-plus-fixed-fee contract for design of one Advanced Reconnaissance Vehicle Medium Caliber Autocannon prototype vehicle. Bids were solicited via the internet with one received. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Sept. 24, 2024. Fiscal 2024 research, development, test and evaluation, Marine Corps funds in the amount of $5,452,228 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W56HZV-24-C-0030). \nBAE Systems Ordnance Systems Inc., Radford, Virginia, was awarded a $9,876,526 modification (P00002) to contract W52P1J-22-F-0124 for procurement of major equipment at the Nitric Acid Concentrator/Sulfuric Acid Concentrator site. Work will be performed in Radford, Virginia, with an estimated completion date of Nov. 16, 2026. Fiscal 2023 procurement of ammunition, Army funds in the amount of $7,407,395 were obligated at the time of the award. U.S. Army Contracting Command, Rock Island Arsenal, Illinois, is the contracting activity. \nGeneral Dynamics Land Systems, Sterling Heights, Michigan, was awarded an $8,212,151 modification (P00062) to contract W56HZV-22-C-0012 for engineering and logistics matrixes. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Feb. 26, 2027. Fiscal 2023 and 2024 weapons and tracked combat vehicle procurement, Army funds; and fiscal 2024 operation and maintenance, Army funds in the amount of $8,212,151, were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity. \nAIR FORCE\nAlutiiq Commercial Enterprises LLC, Anchorage, Alaska, was awarded a $19,122,528 firm-fixed-price contract for providing base operations support services in support of the 733rd Civil Engineer Squadron, Fort Eustis, Virginia. This contract provides for all management, labor, transportation, tools, supplies, and equipment to perform preventive maintenance, corrective maintenance, and sustainment to 428 facilities at Fort Eustis, Virginia. Work will be performed at Fort Eustis, Virginia, and is expected to be completed by Jan. 31, 2025. This contract was a sole source acquisition. Fiscal 2024 operation and maintenance funds in the amount of $8,016,545 are being obligated at time of award. 633rd Contracting Squadron, Joint Base Langley-Eustis, Virginia, is the contracting activity (FA4800-24-C-0006). (Awarded Feb. 28, 2024)\nCORRECTION: The Feb. 28. 2024, announcement of a $27,136,492 bridge extension contract modification (P00043) to Tecolote Research Institute, Goleta, California (FA8807-19-F-0008), for Space and Missile Systems Center acquisition and financial support follow-on services included incorrect funding data. Fiscal 2024 Space Force procurement funds in the amount of $1,998,002; fiscal 2023 research, development, test, and evaluation funds in the amount of $30,748; and fiscal 2024 research, development, test, and evaluation funds in the amount of $1,064,641 are being obligated at time of award. \nDEFENSE LOGISTICS AGENCY\nCapps Shoe Co. LLC,* Gretna, Virginia, has been awarded a maximum $9,851,474 fixed-price, indefinite-delivery/indefinite-quantity contract for women's poromeric dress shoes. This was a competitive acquisition with one response received. This is a two-year contract with no option periods. The ordering period end date is Feb. 27, 2026. Using military services are Air Force and Marine Corps. Type of appropriation is fiscal 2024 through 2026 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania (SPE1C1-24-D-0034).\nUPDATE: Tennant Sales and Service Co., Eden Prairie, Minnesota (SPE8EC-24-D-0032, $93,000,000), has been added as an awardee to the multiple award contract for sweeper and scrubber equipment, issued against solicitation SPE8EC-21-R-0002 and awarded Feb. 22, 2022. \nWASHINGTON HEADQUARTERS SERVICES\nBooz Allen Hamilton Inc., McLean, Virginia, is awarded a modification (P00011) for an Option Year valued at $8,600,454 on a firm-fixed-price contract (HQ003421F0077) to provide technical support services to the Department of Defense Chief Information Officer. Fiscal 2024 operations and maintenance funds in the amount of $8,600,454 are being obligated at the time of award. The cumulative total of the contract is $31,153,084. The total if all options are exercised is $41,088,244. The contractor will provide services including cybersecurity reporting and scorecards; cybersecurity research and analysis; cybersecurity policies, guidance, strategies, and procedures; risk assessment and operational integration; supply chain; public key infrastructure; mobility and wireless networking; defense cyber workforce framework; cyber phishing analyses; network penetration and vulnerability analyses; acquisition systems support; and specialized network vulnerability support. The work will be performed at the Pentagon, Arlington, Virginia. The estimated contract completion date is Nov. 30, 2025. Washington Headquarters Services, Arlington, Virginia, is the contracting activity.\nCACI Inc.-Federal, Chantilly, Virginia, is awarded a firm-fixed-price Task Order (HQ003424F0106) valued at $8,430,856 against a previously issued indefinite-delivery/indefinite-quantity contract (GSA47QTCK18D0009). This Task Order provides technical support services to the Under Secretary of Defense for Acquisition and Sustainment Data Services Office. Fiscal 2024 operations and maintenance funds in the amount of $4,258,013 are being obligated at the time of award. The cumulative total of the contract is $8,430,856. The total if all options are exercised is $43,400,923. The contractor will provide services in support of the Office of the Under Secretary of Defense for Acquisition and Sustainment Data Services Office. These services are in support of mission application development, application hosting, Department of Defense cloud-based infrastructure management, web services, SharePoint development, cybersecurity, database management and analytics, defense business systems, information technology governance and portfolio management, and information technology management, including liaison to broader Office of the Secretary of Defense core information technology services. The work will be performed in Alexandria, Virginia. The estimated contract completion date is Feb. 28, 2025. Washington Headquarters Services, Arlington, Virginia, is the contracting activity.\nDEFENSE HEALTH AGENCY\nCORRECTION: The Feb. 26, 2024, announcement of a $7,567,018 contract modification (P00004) to Axiom Resource Management Inc., Falls Church, Virginia (HT001123F0015), for program management support services included an incorrect period of performance. The modification's actual period of performance is from Feb. 28, 2024, to Feb. 27, 2025. The announcement also included an incorrect amount of obligated funds. This was a competitive acquisition on GSA Alliant 2, and fiscal 2024 Defense Health Agency operations and maintenance funds in the amount of $29,042,273 are being obligated at time of award.\n*Small Business\n\n\n", "Feb. 28, 2024": "\n\n\nNAVY\nMercury Systems Inc., Andover, Maine, is awarded a $243,755,168 firm-fixed-price, indefinite-delivery/indefinite-quantity contract to produce and deliver Digital Radio Frequency Memory units to include incidental teardown, evaluation, repair, and hardware modifications supporting the AN/ULQ-21(V) threat electronic attack jamming suite. This contract is in support of Small Business Innovation Research Phase III topic N06-036 titled, \"Advance Techniques for Digital Radio Frequency Memory\" for the Navy. Work will be performed in Cypress, California, and is expected to be completed in February 2029. No funds will be obligated at the time of award; funds will be obligated on individual orders as they are issued. This contract was not competitively procured pursuant to 15 U.S. Code 638(r)(4). Naval Air Warfare Center Weapons Division is the contracting activity (N6893624D0002).\nNCS/EML SB Joint Venture LLC,* Louisville, Kentucky, is awarded a $13,171,189 firm-fixed price modification to a previously awarded contract (N69450-19-D-1740) to exercise option Period Five for base operations support services. This award brings the total cumulative value of the contract to $74,390,075. Work will be performed in Milton, Florida (67%); and outlying areas (33%), and is expected to be completed by March 2025. No funds will be obligated at time of award. Fiscal 2024 operation and maintenance (Navy); fiscal 2024 Defense Health Program; fiscal 2024 Defense working capital fund; and fiscal 2024 operation and maintenance (Air Force) funds in the amount of $9,212,098, for recurring work will be obligated on a task order issued during the option period. The Naval Facilities Engineering Systems Command Southeast, Jacksonville, Florida, is the contracting activity.\nLockheed Martin Rotary Mission Systems, Moorestown, New Jersey, is awarded a $12,739,254 cost-plus-fixed-fee contract for in-service engineering agent services in support of Command, Control, Communications, Computers, Combat Systems and Intelligence system elements specific to the Freedom variant of the Littoral Combat Ship. This contract includes options which, if exercised, would bring the cumulative value of this contract to $68,956,741. Work will be performed in Baltimore, Maryland (5%); Mayport, Florida (50%); Moorestown, New Jersey (20%); San Diego, California (10%); Oldsmar, Florida (5%); Orlando, Florida (5%); and Virginia Beach, Virginia (5%), and is expected to be completed by February 2025. If all options are exercised, work will continue through February 2029. Fiscal 2023 other procurement (Navy) funds in the amount of $90,000 (84%); and fiscal 2024 operations and maintenance (Navy) funds in the amount of $16,588 (16%), will be obligated at time of award, of which $16,588 will expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 2304(c)(1) (only one responsible source and no other supplies or services will satisfy agency requirements). Naval Surface Warfare Center, Port Hueneme Division, Port Hueneme, California is the contracting activity (N6339424C0003).\nARMY\nNorthrop Grumman Systems Corp., Minneapolis, Minnesota, was awarded a $92,057,685 firm-fixed-price contract for production and delivery of the XM343 Standoff Activated Volcano Obstacle system. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 31, 2028. Army Contracting Command, Newark, New Jersey, is the contracting activity (W15QKN-24-D-0013). \nAugustine Consulting Inc.,* Hamilton, New Jersey, was awarded a $35,886,589 cost-plus-fixed-fee contract for technical and production support for the Nett Warrior Tactical Capability Suite and other systems. Bids were solicited via the internet with one received. Work will be performed in Hamilton, New Jersey, with an estimated completion date of Aug. 30, 2025. Fiscal 2024 other procurement, Army funds in the amount of $25,706,981 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91CRB-24-C-0011). \nGreenup-Cajun JV LLC, Kenner, Louisiana, was awarded a $20,287,532 modification (P00007) to contract W912P8-22-C-0009 for drainage and excavation projects. Work will be performed in Braithwaite, Louisiana, with an estimated completion date of April 28, 2028. Fiscal 2024 civil construction funds in the amount of $20,287,532 were obligated at the time of the award. U.S. Army Corps of Engineers, New Orleans, Louisiana, is the contracting activity. \nGarco Construction Inc., Spokane, Washington, was awarded a $19,687,000 firm-fixed-price contract for construction of a warehouse. Bids were solicited via the internet with one received. Work will be performed in Yakima, Washington, with an estimated completion date of Dec. 19, 2025. Fiscal 2023 and 2024 military construction, Army Reserve funds in the amount of $19,687,000 were obligated at the time of the award. U.S. Army Corps of Engineers, Louisville, Kentucky, is the contracting activity (W912QR-24-C-0005). \nPROJECTXYZ Inc., Huntsville, Alabama, was awarded a $14,708,127 cost-plus-fixed-fee contract for programmatic services for U.S. Army Security Assistance Command. Bids were solicited via the internet with one received. Work locations and funding will be determined with each order, with an estimated completion date of Oct. 31, 2024. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity (W91CRB-24-D-0017). \nThe Boeing Co., Mesa, Arizona, was awarded a $7,866,863 modification (P00012) to contract W58RGZ-21-C-0015 for the procurement of multi-core mission processors. Work locations and funding will be determined with each order, with an estimated completion date of Dec. 27, 2027. Army Contracting Command, Redstone Arsenal, Alabama, is the contracting activity. \nDEFENSE LOGISTICS AGENCY\nLOC Performance Products LLC, Plymouth, Michigan, has been awarded a maximum $41,331,268 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for T-107 track shoes. This was a competitive acquisition with three responses received. This is a five-year contract with no option periods. Location of performance is Ohio, with a Feb. 28, 2029, performance completion date. Using military service is Army. Type of appropriation is fiscal 2024 through 2029 Army working capital funds. The contracting activity is the Defense Logistics Agency Land and Maritime, Warren, Michigan (SPRDL1-24-D-0009).\nAIR FORCE\nTecolote Research Institute, Goleta, California, has been awarded a $27,136,492 bridge extension contract modification (P00043) to previously awarded contract FA8807-19-F-0008 for Space and Missile Systems Center acquisition and financial support follow-on services. The modification brings the total cumulative face value of the contract to $181,949,771. Work will be performed at El Segundo, California, and is expected to be completed by Feb. 28, 2025. Fiscal 2023 Space Force procurement funds in the amount of $1,998,002; and fiscal 2024 research, development, test, and evaluation funds in the amount of $1,095,389, are being obligated at time of award. Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity.\nThe Boeing Corp., St. Louis, Missouri, has been awarded a $21,300,367 firm-fixed-price contract modification (P00037) to previously awarded contract FA8634-21-C-2702 for the F-15 Eagle Passive/Active Warning Survivability System. The modification brings the total cumulative face value of the contract to $805,527,798. Work will be performed at Nashua, New Hampshire, and is expected to be completed by Nov. 30, 2025. Fiscal 2023 procurement funds in the amount of $21,300,367 are being obligated at time of award. The Air Force Life Cycle Management Center, Wright-Patterson Air Force Base, Ohio, is the contracting activity.\nGuidehouse LLP, McLean, Virginia, was awarded a $12,000,000,000 cost-plus-award-fee contract for Integration Support Contract 2.0. This contract provides for the support of the government as the systems integrator and augment government resources for intercontinental ballistic missile, weapon system, systems engineering and integration, and professional services. Work will be performed at Hill Air Force Base, Utah, with various other locations, and is expected to be completed by Aug. 27, 2042. This contract was a competitive acquisition, and five offers were received. Fiscal 2023 missile procurement funds in the amount of $6,204,924; fiscal 2024 research, development, test, and evaluation funds in the amount of $3,700,000; and fiscal 2024 operation and maintenance funds in the amount of $40,095,076, are being obligated at time of award. The Air Force Nuclear Weapons Center, Hill Air Force Base, Utah, is the contracting activity (FA8207-24-D-0001).\nDEFENSE HEALTH AGENCY\nChenega Pro Federal Solutions LLC, San Antonio, Texas, was awarded a $25,000,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract (HT941024D0001) for medically related administrative support services in Japan to provide medical records technician support, medical patient appointing clerical support, medical referral clerical support, medical administrative assistant support, medical advanced officer clerical support, medical administration specialist support, medical billing clerical support, medical physical evaluation board liaison officer support, medical physical evaluation board liaison, beneficiary service representative support, and reference laboratory administrative clerical support. Work will be performed at multiple Navy and Air Force military treatment facilities throughout Japan. The contract was a direct award through the Small Business Administration 8(a) program in accordance with 15 U.S. Code 637 as implemented by Federal Acquisition Regulation 6.302-5(b)(4) and was executed on Feb. 27, 2024. Period of performance is Mar. 1, 2024, to Aug. 31, 2026. Fiscal 2024 operations and maintenance funding was obligated at time of award. The Defense Health Agency, Western Healthcare Operations Contracting Division, San Diego, California, is the contracting activity.\nAgile Decision Sciences LLC, Huntsville, Alabama, is awarded a $9,691,248 firm-fixed-price contract (HT001124C0007) for administrative, analytical, and consulting services to support, analyze, and investigate issues related to military public health, force health protection, and health service support during deployments, extended training missions, and operational testing. Services include management, planning and execution support; studies, analytical, and evaluation support; administrative support; document and records management; business process reengineering; logistical support; budget planning and management; knowledge management; and business office support. Supported organizations include the Deputy Assistant Secretary of Defense for Health Readiness Programs and Oversight, Principal Deputy Assistant Secretary of Defense for Health Affairs, Office of the Assistant Secretary of Defense for Health Affairs, the Director, Defense Health Agency, the Chief of Staff, and other subordinate program directorates. The award obligates fiscal 2024 operations and maintenance appropriations for services through Dec. 6, 2024. Total value of the contract is $73,187,618. The contract was procured under full and open competition set aside for small business with six proposals received. The Defense Health Agency Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity. \n*Small Business\n\n\n", "Feb. 27, 2024": "\n\n\nARMY\nGeneral Dynamics Land Systems Inc., Sterling Heights, Michigan, was awarded a $210,343,447 hybrid (cost-plus-fixed-fee and cost-plus-incentive-fee) contract for the purchase, warehousing, repair, issue, shipment, disposal, obsolescence management and configuration management of parts to support the Stryker Brigade Combat Team. Bids were solicited via the internet with one received. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Feb. 28, 2030. Fiscal 2024 Army working capital funds; and fiscal 2024 operation and maintenance, Army funds in the amount of $210,343,447, were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W56HZV-24-D-0031). \nHSG Park JV 2 LLC, Harvey, North Dakota, was awarded a $13,208,257 firm-fixed-price contract for the Fargo Moorhead Metropolitan Area Flood Risk Management Project. Bids were solicited via the internet with three received. Work will be performed in Fargo, North Dakota, with an estimated completion date of March 12, 2027. Fiscal 2024 civil construction funds in the amount of $13,208,257 were obligated at the time of the award. U.S. Army Corps of Engineers, St. Paul, Minnesota, is the contracting activity (W912ES-24-C-0008). \nDEFENSE HEALTH AGENCY\nManTech Advanced Systems International Inc., Herndon, Virginia, was awarded a $166,002,668 General Services Administration (GSA) Alliant 2 hybrid, firm-fixed-price, and cost-plus-award-fee, non-personal service contract for full software lifecycle services for the LogiCole application and legacy applications of Defense Medical Logistics Standard Support and Theater Enterprise-Wide Logistics System until their full rationalization into LogiCole no later than August 2027. The performance-based outcome objectives will be in the form of working software where functionality can be showcased and used by the end-user. The period of performance is Feb. 1, 2024, to Jan. 31, 2029. This is a 12-month base period to include a 30-day transition-in period with four 12-month option periods. This contract was a competitive acquisition on GSA Alliant 2, and fiscal 2024 Defense Health Agency operations and maintenance funds in the amount of $33,802,893, are being obligated at time of award. The place of performance is Fort Detrick, Maryland. The U.S. Army Medical Research Acquisition Activity, Fort Detrick, Maryland, is the contracting activity (47QTCK18D0031, Task Order HT9425-24-F-0015).\nNAVY\nRaytheon Co., Tucson, Arizona, is awarded a $73,919,678 cost-plus-fixed-fee modification to a previously awarded contract (N00024-23-C-5410) to exercise options for Standard Missiles Two and Six engineering and technical support. This modification involves Foreign Military Sales (FMS) to Australia. Work will be performed in Tucson, Arizona (95%); Camden, Arkansas (2%); St. Petersburg, Florida (2%); and Huntsville, Alabama (1%), and is expected to be completed by September 2025. Fiscal 2023 weapons procurement (Navy) funds in the amount of $3,400,000 (69%); fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $1,229,512 (25%); and FMS funds (Australia) in the amount of $300,000 (6%), will be obligated at time of award and will not expire at the end of the current fiscal year. This contract was not competitively procured in accordance with 10 U.S. Code 3204(a)(1) (only one responsible source and no other supplies or services will satisfy agency requirements). The Naval Sea Systems Command, Washington, D.C., is the contracting activity. \nAIR FORCE\nAnalex Corp., doing business as Arcfield, Chantilly, Virginia, was awarded a $52,636,850 cost-plus-fixed-fee level of effort order for Xdomain Technology Through Research, Evolution, Enhancements, Maintenance and Support - Next Generation software and hardware. This contract provides for essential life cycle support functions for, and to evolve, the Information Support Server Environment and the X-domain Agile Rules-Based Information Transfer OrchestratoR Cross Domain Solution National Security Systems and associated core data services suite of solutions and technologies. Work will be performed in Rome, New York; and various locations worldwide, and is expected to be completed by April 25, 2029. This contract involves Foreign Military Sales to Australia, the Netherlands, and the United Kingdom. This contract was a competitive acquisition, and one offer was received. Fiscal 2024 research, development, test, and evaluation funds in the amount of $2,455,278; fiscal 2024 procurement funds in the amount of $$3,101,736; and fiscal 2024 operation and maintenance funds in the amount of $600,615, are being obligated at time of award. The Air Force Research Laboratory, Rome, New York, is the contracting activity (FA8750-24-F-B003).\nCarahsoft Technology Corp., Reston, Virginia, has been awarded a $27,881,486 firm-fixed-price contract action, for Salesforce and third-party licenses and support. This contract provides for Salesforce Customer Relationship Management software licenses. Work will be performed in Washington, D.C., and is expected to be completed Feb. 27, 2025. This contract was a sole source acquisition. Fiscal 2024 operation and maintenance funds in the amount of $18,023,730 are being obligated at time of award. The Air Force District of Washington, Joint Base Andrews, Maryland, is the contracting activity (FA7014-24-F-0087).\nLinQuest Corp., Los Angeles, California, has been awarded a $18,459,367 cost-plus-incentive-fee modification (P00096) to previously awarded contract FA8808-19-C-0006 for additional systems engineering, integration, and test support. The modification brings the total cumulative face value of the contract $672,193,257. Work will be performed in El Segundo, California, and is expected to be completed by Feb. 27, 2027. No funds are being obligated at time of award. Space Systems Command, Los Angeles Air Force Base, California, is the contracting activity. (Awarded Feb. 26, 2024)\n*Small Business\n\n\n", "Feb. 26, 2024": "\n\n\nNAVY\nThe Boeing Co., St. Louis, Missouri, is awarded an $86,427,453 cost-plus-fixed-fee order (N6833524F0122) against a previously issued basic ordering agreement (N0001921G0006). This order provides for the design, development, and production of two Operational Test Program Sets prototypes and special test equipment in support of the AN/ASG-34A (V)1 Infrared Search and Track System field testing for the Navy and the government of Australia. Work will be performed in St. Louis, Missouri and is expected to be completed in February 2029. Fiscal 2024 aircraft procurement (Navy) funds in the amount of $16,345,133; fiscal 2023 aircraft procurement (Navy) funds in the amount of $42,128,028; fiscal 2022 aircraft procurement (Navy) funds in the amount of $22,954,291; and Foreign Military Sales customer funds in the amount of $5,000,000 will be obligated at the time of award, $22,954,291 of which will expire at the end of the current fiscal year. Naval Air Warfare Center Aircraft Division, Lakehurst, New Jersey, is the contracting activity.\nGeneral Atomics Aeronautical Systems Inc., Poway, California, is awarded a $31,003,429 cost-plus-fixed-fee order (N0001924F0168) against a previously issued basic ordering agreement (N0001922G0006). This order provides non-recurring engineering for the installation, integration, systems test and evaluation, calibration, and logistics in support of the development and production of electronic warfare pods for the Marine Corps. Work will be performed in Poway, California (45%); Patuxent River, Maryland (45%); and Greenville, Texas (10%), and is expected to be completed in July 2025. Fiscal 2024 research, development, test and evaluation (Navy) funds in the amount of $13,400,000; and fiscal 2023 research, development, test and evaluation (Navy) funds in the amount of $9,858,485 will be obligated at the time of award, $9,858,485 of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.\nGeneral Atomics Aeronautical Systems Inc., Poway, California, is awarded a $30,885,042 cost-plus-fixed-fee order (N0001924F5565) against a previously issued basic ordering agreement (N0001922G0006). This order provides for the development, integration, test, and certification of the MQ-9A Detect and Avoid System for the Marine Corps. Work will be performed in Poway, California (85%); and Patuxent River, Maryland (15%), and is expected to be completed in April 2026. Fiscal 2024 research, development, test, and evaluation (Navy) funds in the amount of $14,174,839 will be obligated at the time of award, none of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.\nSOLUTE, San Diego, California, was awarded a $19,247,894 cost-plus-fixed-fee and cost contract for the Autonomy Baseline Manager to support oversight and management of autonomous systems development and the associated central software repository for unmanned autonomy artifacts, processes, and procedures. This contract includes options which, if exercised, would bring the cumulative value of this contract to $59,314,021. Work will be performed in Arlington, Virginia (70%); Panama City, Florida (20%); and San Diego, California (10%), and is expected to be completed by February 2025. If all options are exercised, work will continue through February 2029. Fiscal 2023 research, development, testing, and evaluation (Navy) funds in the amount of $480,963 will be obligated at time of award, of which $480,963 will expire at the end of the current fiscal year. This contract was competitively procured via the SAM.gov website, with two offers received. The Naval Sea Systems Command, Washington, D.C., is the contracting activity (N00024-24-C-6301). (Awarded Feb. 9, 2024)\nTriumph Gear Systems Inc., Park City, Utah, is awarded $18,480,000 for a delivery order (N00383-24-F-S802) under previously awarded contract N00383-22-G-S801 for the repair of one item that is part of the V-22 pylon conversion actuator system. All work will be performed in Park City, Utah. Work is expected to be completed by April 2025. Annual working capital funds (Navy) in the full amount of $18,480,000 will be obligated at the time of award. Funds will not expire at the end of the current fiscal year. One company was solicited for this sole-source requirement pursuant to the authority set forth in 10 U.S. Code 3204 (a)(1), with one offer received. Naval Supply Systems Command Weapon Systems Support, Philadelphia, Pennsylvania, is the contracting activity.\nSustainment & Restoration Services LLC,* Milwaukee, Wisconsin, is awarded a maximum-value $14,500,000 firm-fixed-price, indefinite-delivery/indefinite-quantity contract for operational range clearance, range residue removal, and maintenance to support Navy, Marine Corps, and other Department of Defense installations and federal agencies worldwide. This contract includes options which, if exercised, would extend the period of performance to February 2029. No task orders are being issued at this time. Work will be performed at Navy and Marine Corps facilities and other government facilities within the Naval Facilities Engineering Systems Command Atlantic area of responsibility, and is expected to be completed by January 2029. Fiscal 2024 operation and maintenance (Navy) funds in the amount of $5,000 will be obligated at time of award in order to satisfy the minimum guarantee and will expire at the end of the current fiscal year. This contract was procured via sole-source acquisition pursuant to Federal Acquisition Regulation 19.805-1(b)(2) (Small Business Association-accepted Indian tribe or Alaska Native Corporation). The Naval Facilities Engineering Systems Command Atlantic, Norfolk, Virginia, is the contracting activity (N62470-24-D-0003).\nLockheed Martin Corp., Lockheed Martin Aeronautics Co., Fort Worth, Texas, is awarded an $11,237,786 cost-plus-fixed-fee order (N0001924F0205) against a previously issued basic ordering agreement (N0001919G0008). This order provides for the completion of all fabrication, hardware and software integration, documentation, and verification testing for final operational capability of the Mission Systems Test Capability systems in support of enabling multi-ship F-35 testing with a single F-35 in a ground-test environment. Work will be performed in Fort Worth, Texas, and is expected to be completed in February 2026. Fiscal 2023 research, development, test and evaluation (Defense-Wide) funds in the amount of $7,100,000 will be obligated at the time of award, all of which will expire at the end of the current fiscal year. Naval Air Systems Command, Patuxent River, Maryland, is the contracting activity.\nApplied Research Laboratories, The University of Texas at Austin, Austin, Texas, is awarded an $8,141,445 cost-plus-fixed-fee contract for the Ownship Vulnerability Development. This contract provides for research focused on two complementary technical thrusts. The first will develop algorithms to assess the probability of detection of underwater sound sources by estimating the background noise level relative to platform signal level and using this information in a decision aid. The second thrust will employ numerical modeling and the development of experimental procedures and apparatus to measure the vibroacoustic response of materials for Navy applications. This portion of the effort will develop detailed analytic and numerical models to predict those responses and then to assess the accuracy of those models for their use in design studies. Work will be performed in Austin, Texas, and is expected to be completed in February 2029. The total cumulative value of this contract, including a 60-month base period with no option periods, is $8,141,445. Fiscal 2023 research, development, test and evaluation (Navy) funds in the amount of $420,000 are obligated at time of award. Funds in the amount of $20,000 will expire at the end of the current fiscal year. This contract was competitively procured under N0001423SB001 entitled “Long Range Broad Agency Announcement (BAA) for Navy and Marine Corps Science and Technology.” Since proposals are received throughout the year under the long-range BAA, the number of proposals received in response to the solicitation is unknown. The Office of Naval Research, Arlington, Virginia, is the contracting activity (N0001424C1315).\nAIR FORCE\nAdacel Systems Inc, Orlando, Florida, has been awarded a $49,157,122 firm-fixed price, commercial services contract for contractor logistics support. This contract provides contractor logistics support of the Tower Simulation System program for Air Force, Air Force Reserve Command and Air National Guard sites worldwide. Work will be performed globally and is expected to be completed by Aug. 31, 2029. This contract was a sole-source acquisition. Fiscal 2024 operation and maintenance funds in the amount of $3,517,406 are being obligated at time of award. The Air Force Sustainment Center, Tinker Air Force Base, Oklahoma, is the contracting activity (FA8100-24-C-0001).\nAccenture Federal Services LLC, Arlington, Virginia, was awarded an $11,462,043 firm-fixed-price contract modification (P00024) to previously awarded contract FA8307-21-F-0035 to exercise Option Year 2 for the Joint Cyber Command and Control Joint Application Support Contract Team 5. Work will be performed in the continental U.S. and is expected to be completed Feb. 24, 2025. Operation and maintenance funds in the amount of $1,400,000; and research, development, test and evaluation funds in the amount of $355,000 are being obligated at time of award. The Air Force Life Cycle Management Center, Joint Base San Antonio, Texas, is the contracting activity. (Awarded Feb. 23, 2024)\nARMY\nGeotechnical Construction Inc., Mount Olive, Illinois, was awarded a $24,000,000 firm-fixed-price contract for rehabilitation, repair, construction, and maintenance functions at the Wappapello Lake Project. Bids were solicited via the internet with three received. Work locations and funding will be determined with each order, with an estimated completion date of Aug. 31, 2029. U.S. Army Corps of Engineers, Seattle, Washington, is the contracting activity (W912P9-24-D-0004).  \nGeneral Dynamics Land Systems, Sterling Heights, Michigan, was awarded a $21,554,936 modification (P00002) to contract W56HZV-23-C-0059 for receipt, inspection, testing, diagnosis, repair, storage, issue and unique identification marking of parts. Work will be performed in Sterling Heights, Michigan, with an estimated completion date of Sept. 30, 2026. Fiscal 2024 Army working capital funds in the amount of $21,554,936 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity. \nDirect Viz Solutions, Chantilly, Virginia, was awarded a $21,464,052 modification (P00039) to contract W91RUS-19-C-0014 for command, control, communications, computers and information management; common-user services; and operating, managing and defending IT infrastructure. Work will be performed at Fort Huachuca, Arizona, with an estimated completion date of Aug. 31, 2024. Fiscal 2024 operation and maintenance, Army funds in the amount of $21,464,052 were obligated at the time of the award. Army Contracting Command, Aberdeen Proving Ground, Maryland, is the contracting activity. \nKansas Department for Children and Families, Topeka, Kansas, was awarded a $10,810,588 firm-fixed-price contract for food service program support services. Bids were solicited via the internet with six received. Work locations and funding will be determined with each order, with an estimated completion date of Feb. 28, 2029. Army Field Directorate Office, Fort Sam Houston, Texas, is the contracting activity (W5168W-24-D-0004). \nAjax Tocco Magnethermic Corp., Warren, Ohio, was awarded an $8,364,300 firm-fixed-price contract for a new induction furnace system. Bids were solicited via the internet with one received. Work will be performed in Watervliet, New York, with an estimated completion date of June 30, 2026. Fiscal 2023 other procurement, Army funds in the amount of $8,364,300 were obligated at the time of the award. Army Contracting Command, Detroit Arsenal, Michigan, is the contracting activity (W911PT-24-C-0003). \nDEFENSE LOGISTICS AGENCY\nTravis Association for the Blind,** doing business as The Lighthouse for the Blind, Austin, Texas, has been awarded a maximum $21,665,041 modification (P00010) exercising the first one-year option period of a two-year base contract (SPE1C1-22-D-B123) with three one-year option periods for warehousing, storage, logistics and distribution functions. This is a firm-fixed-price with economic-price-adjustment, indefinite-delivery/indefinite-quantity contract. The ordering period end date is Feb. 28, 2025. Using military services are Air Force and Marine Corps. Type of appropriation is fiscal 2024 through 2025 defense working capital funds. The contracting activity is the Defense Logistics Agency Troop Support, Philadelphia, Pennsylvania. \nUPDATE: Veterans Healthcare Supply Solutions Inc., Jacksonville, Florida (SPE2DE-24-D-0012, $45,000,000), has been added as an awardee to the multiple award contract for dental consumable items for the Defense Logistics Agency Electronic Catalog, issued against solicitation SPE2DE-20-R-0007 and awarded June 10, 2021.\nDEFENSE HEALTH AGENCY\nAxiom Resource Management Inc., Falls Church, Virginia, is awarded a $7,567,018 modification (P00004) to a firm-fixed-price order (HT001123F0015) for program management support services to the TRICARE Health Plan (THP), clinical services, pharmacy, and all subordinate chiefs, managers and staff.  The services will support functions of management and administration of THP programs; management of the Military Health System health plan and associated managed health care programs; program and acquisition management of TRICARE purchased health care services; management and administration of programs and activities; operation of elements of the Office of the Deputy Assistant Director, Health Care Operations, and THP; and overall accomplishment of the missions, functions, and tasks of the THP enterprise and its organizational entities. The modification obligates $7,567,018 in fiscal 2024 operations and maintenance appropriations for services through March 8, 2024. Total value of the order is $18,161,293. Places of performance are Falls Church, Virginia; Aurora, Colorado; and San Antonio, Texas. The order was procured under limited sources justification with one quote received. The Defense Health Agency, Professional Services Contracting Division, Falls Church, Virginia, is the contracting activity. (Awarded Jan. 19, 2024)\n\r\n*Small Business\r\n** Mandatory source\n\n\n"}